from enum import StrEnum


class ExtraButton(StrEnum):
    OFFICIAL_SOURCE = "📚 بر اساس منابع رسمی"
    USER_EXPERIENCES = "👥 بر اساس تجربیات دیگران"


class MenuButtons(StrEnum):
    IMMIGRATION_QUESTION = "❓ در مورد مهاجرت سوال دارم"
    JOB_SEARCH = "💼 دنبال موقعیت‌های شغلی می‌گردم"
    RESUME_REVIEW = "📝 می‌خوام رزومه‌ی منو بررسی کنی"
    CASH_BALANCE = "💰 موجودی کیف پول"
    INCREASE_CREDIT = "💳 افزایش اعتبار"
    SUPPORT = "📞 پشتیبانی"
    LANGUAGE = "🌐 Language"
    HOME = "🏠 بازگشت به منو اصلی"


class MessageEnum(StrEnum):
    WELCOME = (
        "سلام، من السا هستم!\n"
        "چطور میتونم کمکتون کنم...؟"
    )

    LEGAL_RESPONSE = (
        "بسیار خوب؛ جواب سؤالاتت رو میخوای بر اساس اطلاعات مراجع رسمی و معتبر "
        "بدم، یا بر اساس گفته‌ها و تجربیات سایر افراد...؟"
    )

    LANGUAGE_RESPONSE = (
        " در حال یادگیری زبان جدید :)"
        "این بخش در آینده بروز می‌شود.😊"
    )

    JOB_SEARCH = (
        "من می‌تونم در پیدا کردن بهترین موقعیت‌های شغلی بهت کمک کنم. "
        "فقط کافیه یه کم در مورد شغلی که دنبالشی بهم بگی و باقیشو بسپاری به من…"
    )

    IMMIGRATION_QUESTION = (
        "بسیار خوب؛ جواب سؤالاتت رو میخوای بر اساس اطلاعات مراجع رسمی و "
        "معتبر بدم، یا بر اساس گفته‌ها و تجربیات سایر افراد...؟"
    )

    RESUME_RESPONSE = "این بخش در دست تعمیره :)" \
                      "به زودی آماده و بروز میشه."

    INCREASE_CREDIT = (
        "استفاده از السا فعلاً رایگانه :).\n"
        "اگه برات مفید بوده، میتونی برای حمایت از ما، از طریق ارتباط با پشتیبانی، بهمون بازخورد بدی و به ما در ارتقاء کیفیتش "
        "کمک کنی..\n"
        "\n\nآی‌دی پشتیبانی:"
        "🆔: @mbaqer"
    )

    CASH_BALANCE = (
        "استفاده از السا فعلاً رایگانه :).\n"
        "اگه برات مفید بوده، میتونی برای حمایت از ما، از طریق ارتباط با پشتیبانی، بهمون بازخورد بدی و به ما در ارتقاء کیفیتش "
        "کمک کنی..\n"
        "\n\nآی‌دی پشتیبانی:"
        "🆔: @mbaqer"
    )

    SUPPORT = (
        "برای راهنمایی بیشتر، رفع سریع هرگونه مشکل و یا پیشنهاد بهبود، با خیال راحت به آی‌دی پشتیبان: @mbaqer پیام بدین :) 💌"
    )

    LEGAL_RESPONSE_BOT = (
        "بسیار عالی؛ حالا می‌تونی هر سؤالی که می‌خوای رو بپرسی و من بر "
        "اساس اطلاعات مراجع رسمی بهت جواب میدم. برای اطمینان بیشتر اسم "
        "و لینک منبع رو هم در انتهای جواب برات می‌نویسم."
    )

    EXPERIENCE_RESPONSE_BOT = (
        "خوبه؛ حالا می‌تونی هر سؤالی که می‌خوای رو بپرسی و من بر اساس "
        "گفته‌های دیگران بهت جواب میدم."
    )
